---
kind: property
id: P:Autodesk.Revit.DB.Visual.BumpMap.BumpmapNormalScale
source: html/b60fc242-417c-9c12-1540-e3c472e95b70.htm
---
# Autodesk.Revit.DB.Visual.BumpMap.BumpmapNormalScale Property

The property labeled "Amount" from the "BumpMap" schema.

## Syntax (C#)
```csharp
public static string BumpmapNormalScale { get; }
```

## Remarks
This property is of type "AssetPropertyDouble".